evm100/Wifi-motion/firmware/tx-node/sdkconfig.defaults.esp32s3
# ESP32-S3 specific settings
CONFIG_IDF_TARGET="esp32s3"

# PSRAM Octal SPI (N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash (16 MB Quad SPI)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
